{
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B_Account",
    "1": "B_Address",
    "2": "B_Asset",
    "3": "B_Balance",
    "4": "B_Blood_Pressure",
    "5": "B_Blood_Type",
    "6": "B_Body_Height",
    "7": "B_Body_Weight",
    "8": "B_Card_Number",
    "9": "B_Criminal_Hist",
    "10": "B_DOB",
    "11": "B_Edu_Hist",
    "12": "B_Gender",
    "13": "B_Location",
    "14": "B_Mail",
    "15": "B_Marr_Status",
    "16": "B_Med_Hist",
    "17": "B_NIP",
    "18": "B_Name",
    "19": "B_Nickname",
    "20": "B_Occ_Hist",
    "21": "B_POB",
    "22": "B_Parent_Name",
    "23": "B_Phone_Number",
    "24": "B_Plate",
    "25": "B_Race",
    "26": "B_Religion",
    "27": "B_SSN",
    "28": "B_Salary",
    "29": "B_Score",
    "30": "B_Username",
    "31": "B_Work_Mail",
    "32": "B_Work_Phone_Number",
    "33": "I_Account",
    "34": "I_Address",
    "35": "I_Asset",
    "36": "I_Balance",
    "37": "I_Blood_Pressure",
    "38": "I_Blood_Type",
    "39": "I_Body_Height",
    "40": "I_Body_Weight",
    "41": "I_Card_Number",
    "42": "I_Criminal_Hist",
    "43": "I_DOB",
    "44": "I_Edu_Hist",
    "45": "I_Gender",
    "46": "I_Location",
    "47": "I_Marr_Status",
    "48": "I_Med_Hist",
    "49": "I_NIP",
    "50": "I_Name",
    "51": "I_Occ_Hist",
    "52": "I_POB",
    "53": "I_Parent_Name",
    "54": "I_Phone_Number",
    "55": "I_Plate",
    "56": "I_Race",
    "57": "I_Religion",
    "58": "I_SSN",
    "59": "I_Salary",
    "60": "I_Score",
    "61": "I_Username",
    "62": "I_Work_Phone_Number",
    "63": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B_Account": 0,
    "B_Address": 1,
    "B_Asset": 2,
    "B_Balance": 3,
    "B_Blood_Pressure": 4,
    "B_Blood_Type": 5,
    "B_Body_Height": 6,
    "B_Body_Weight": 7,
    "B_Card_Number": 8,
    "B_Criminal_Hist": 9,
    "B_DOB": 10,
    "B_Edu_Hist": 11,
    "B_Gender": 12,
    "B_Location": 13,
    "B_Mail": 14,
    "B_Marr_Status": 15,
    "B_Med_Hist": 16,
    "B_NIP": 17,
    "B_Name": 18,
    "B_Nickname": 19,
    "B_Occ_Hist": 20,
    "B_POB": 21,
    "B_Parent_Name": 22,
    "B_Phone_Number": 23,
    "B_Plate": 24,
    "B_Race": 25,
    "B_Religion": 26,
    "B_SSN": 27,
    "B_Salary": 28,
    "B_Score": 29,
    "B_Username": 30,
    "B_Work_Mail": 31,
    "B_Work_Phone_Number": 32,
    "I_Account": 33,
    "I_Address": 34,
    "I_Asset": 35,
    "I_Balance": 36,
    "I_Blood_Pressure": 37,
    "I_Blood_Type": 38,
    "I_Body_Height": 39,
    "I_Body_Weight": 40,
    "I_Card_Number": 41,
    "I_Criminal_Hist": 42,
    "I_DOB": 43,
    "I_Edu_Hist": 44,
    "I_Gender": 45,
    "I_Location": 46,
    "I_Marr_Status": 47,
    "I_Med_Hist": 48,
    "I_NIP": 49,
    "I_Name": 50,
    "I_Occ_Hist": 51,
    "I_POB": 52,
    "I_Parent_Name": 53,
    "I_Phone_Number": 54,
    "I_Plate": 55,
    "I_Race": 56,
    "I_Religion": 57,
    "I_SSN": 58,
    "I_Salary": 59,
    "I_Score": 60,
    "I_Username": 61,
    "I_Work_Phone_Number": 62,
    "O": 63
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
